micro_manager_api/app/controllers/campaigns_controller.rb

SELECT  "campaigns".* FROM "campaigns" ORDER BY "campaigns"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
SELECT COUNT(*) FROM "campaigns"
---
  def index
    @campaigns = Campaign.all
    totalCampaignCount = Campaign.count

INSERT INTO "campaigns" ("title", "created_at", "updated_at", "user_id", "theme") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "singapore"], ["created_at", "2020-02-24 17:28:27.116148"], ["updated_at", "2020-02-24 17:28:27.116148"], ["user_id", 1], ["theme", "luckydrawsample"]]
---
  def create
    @campaign = Campaign.new(campaign_params)

    if @campaign.save

UPDATE "campaigns" SET "html_head" = $1, "html_body" = $2, "updated_at" = $3 WHERE "campaigns"."id" = $4  [["html_head", "<h1>head</h1>"], ["html_body", "<h2>body</h2>"], ["updated_at", "2020-02-19 11:24:40.333965"], ["id", 48]]
---
  def update
    if @campaign.update(campaign_params)

DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 3]]
---
  def destroy
    # if request.params.filter
    # else
    # end
    @campaign.destroy

DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 31]]
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def destroy_many
    puts "LOOK HERE"

    items = JSON.parse(request.params[:filter])["id"]

    for item in items
      Campaign.find(item).destroy

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_campaign
      @campaign = Campaign.find(params[:id])