micro_manager_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all

    totalUserCount = @users.count